# 8 Introduction to Pandas

## The DataFrame

In [21]:
import json
import pandas as pd

In [50]:
df = pd.read_json('nobel_winners/nobel_winners2.json')

In [35]:
df.head()

,link,name,year,category,country,born_in,text,date_of_birth,date_of_death,place_of_birth,place_of_death,gender
0,http://en.wikipedia.org/wiki/Karl_Landsteiner,Karl Landsteiner,1930,Physiology or Medicine,Austria,,"Karl Landsteiner , Physiology or Medicine, 1930",14 June 1868,26 June 1943,Vienna,New York City,male
1,http://en.wikipedia.org/wiki/Elfriede_Jelinek,Elfriede Jelinek,2004,Literature,Austria,,"Elfriede Jelinek , Literature, 2004",20 October 1946,NaN,Mürzzuschlag,NaN,female
2,http://en.wikipedia.org/wiki/Eric_Kandel,Eric Kandel *,2000,Physiology or Medicine,,Austria,"Eric Kandel *, Physiology or Medicine, 2000",7 November 1929,NaN,Vienna,NaN,male
3,http://en.wikipedia.org/wiki/Walter_Kohn,Walter Kohn *,1998,Chemistry,,Austria,"Walter Kohn *, Chemistry, 1998",9 March 1923,19 April 2016,Vienna,Santa Barbara,male
4,http://en.wikipedia.org/wiki/Friedrich_Hayek,Friedrich Hayek,1974,Economics,Austria,,"Friedrich Hayek , Economics, 1974",8 May 1899,23 March 1992,Vienna,Freiburg im Breisgau,male

### Indices

In [36]:
df.columns

Index(['link', 'name', 'year', 'category', 'country', 'born_in', 'text',
       'date_of_birth', 'date_of_death', 'place_of_birth', 'place_of_death',
       'gender'],
      dtype='object')

In [37]:
df.index

RangeIndex(start=0, stop=326, step=1)

In [38]:
df = df.set_index('name')
df.loc['Albert Einstein']

link              http://en.wikipedia.org/wiki/Albert_Einstein
year                                                      1921
category                                               Physics
country                                                Germany
born_in
text                           Albert Einstein , Physics, 1921
date_of_birth                                    14 March 1879
date_of_death                                    18 April 1955
place_of_birth                                             Ulm
place_of_death                                       Princeton
gender                                                    male
Name: Albert Einstein, dtype: object

### Rows and Columns

In [39]:
df.iloc[2]

link                 http://en.wikipedia.org/wiki/Eric_Kandel
year                                                     2000
category                               Physiology or Medicine
country
born_in                                               Austria
text              Eric Kandel *, Physiology or Medicine, 2000
date_of_birth                                 7 November 1929
date_of_death                                             NaN
place_of_birth                                         Vienna
place_of_death                                            NaN
gender                                                   male
Name: Eric Kandel *, dtype: object

In [41]:
gender_col = df.gender
type(gender_col)

pandas.core.series.Series

In [42]:
gender_col.head()

name
Karl Landsteiner      male
Elfriede Jelinek    female
Eric Kandel *         male
Walter Kohn *         male
Friedrich Hayek       male
Name: gender, dtype: object

### Selecting Groups

In [52]:
df_g = df.groupby('category')

In [53]:
df_g.groups.keys()

dict_keys(['Chemistry', 'Economics', 'Literature', 'Peace', 'Physics', 'Physiology or Medicine'])

In [54]:
phy_group = df_g.get_group('Physics')
phy_group.head()

,link,name,year,category,country,born_in,text,date_of_birth,date_of_death,place_of_birth,place_of_death,gender
14,http://en.wikipedia.org/wiki/Hans_Bethe,Hans Bethe *,1967,Physics,,Germany,"Hans Bethe *, Physics, 1967",2 July 1906,6 March 2005,Strasbourg,Ithaca,male
16,http://en.wikipedia.org/wiki/James_Franck,James Franck,1925,Physics,Germany,,"James Franck , Physics, 1925",26 August 1882,21 May 1964,Hamburg,Göttingen,male
21,http://en.wikipedia.org/wiki/Charles_K._Kao,Charles K. Kao,2009,Physics,Hong Kong,,"Charles K. Kao , Physics, 2009",4 November 1933,23 September 2018,Shanghai,Sha Tin,male
26,http://en.wikipedia.org/wiki/Philipp_Lenard,Philipp Lenard,1905,Physics,Germany,,"Philipp Lenard , born in Pressburg , Kingdo...",7 June 1862,20 May 1947,Bratislava,Messelhausen,male
31,http://en.wikipedia.org/wiki/Wilhelm_Conrad_R%...,Wilhelm Conrad Röntgen,1901,Physics,Germany,,"Wilhelm Conrad Röntgen , Physics, 1901",27 March 1845,10 February 1923,Lennep,Munich,male

In [55]:
df.category == 'Physics'

0      False
1      False
2      False
3      False
4      False
       ...
321    False
322    False
323    False
324    False
325    False
Name: category, Length: 326, dtype: bool

In [56]:
df[df.category == 'Physics']

,link,name,year,category,country,born_in,text,date_of_birth,date_of_death,place_of_birth,place_of_death,gender
14,http://en.wikipedia.org/wiki/Hans_Bethe,Hans Bethe *,1967,Physics,,Germany,"Hans Bethe *, Physics, 1967",2 July 1906,6 March 2005,Strasbourg,Ithaca,male
16,http://en.wikipedia.org/wiki/James_Franck,James Franck,1925,Physics,Germany,,"James Franck , Physics, 1925",26 August 1882,21 May 1964,Hamburg,Göttingen,male
21,http://en.wikipedia.org/wiki/Charles_K._Kao,Charles K. Kao,2009,Physics,Hong Kong,,"Charles K. Kao , Physics, 2009",4 November 1933,23 September 2018,Shanghai,Sha Tin,male
26,http://en.wikipedia.org/wiki/Philipp_Lenard,Philipp Lenard,1905,Physics,Germany,,"Philipp Lenard , born in Pressburg , Kingdo...",7 June 1862,20 May 1947,Bratislava,Messelhausen,male
31,http://en.wikipedia.org/wiki/Wilhelm_Conrad_R%...,Wilhelm Conrad Röntgen,1901,Physics,Germany,,"Wilhelm Conrad Röntgen , Physics, 1901",27 March 1845,10 February 1923,Lennep,Munich,male
...,...,...,...,...,...,...,...,...,...,...,...,...
291,http://en.wikipedia.org/wiki/Zhores_Alferov,Zhores Alferov *,2000,Physics,,Belarus,"Zhores Alferov *, Physics, 2000",15 March 1930,1 March 2019,Vitebsk,Saint Petersburg,male
292,http://en.wikipedia.org/wiki/Fran%C3%A7ois_Eng...,François Englert,2013,Physics,Belgium,,"François Englert , Physics, 2013",6 November 1932,NaN,Etterbeek,NaN,male
310,http://en.wikipedia.org/wiki/Donna_Strickland,Donna Strickland,2018,Physics,Canada,,"Donna Strickland , Physics, 2018",29 May 1959,NaN,Guelph,NaN,female
311,http://en.wikipedia.org/wiki/Arthur_B._McDonald,Arthur B. McDonald,2015,Physics,Canada,,"Arthur B. McDonald , Physics, 2015",29 August 1943,NaN,Sydney,NaN,male
314,http://en.wikipedia.org/wiki/Brian_Schmidt,Brian Schmidt,2011,Physics,Australia,,"Brian Schmidt , born in the United States , P...",24 February 1967,NaN,Missoula,NaN,male

### Creating and Saving DataFrames

In [58]:
df = pd.DataFrame({
    'name': ['Albert Einstein', 'Marie Curie', 'William Faulkner'],
    'category': ['Physics', 'Chemistry', 'Literature']
})

In [59]:
df

               name    category
0   Albert Einstein     Physics
1       Marie Curie   Chemistry
2  William Faulkner  Literature

In [61]:
df = pd.DataFrame.from_dict([
    {'name': 'Albert Einstein', 'category': 'Physics'},
    {'name': 'Marie Curie', 'category': 'Chemistry'},
    {'name': 'William Faulkner', 'category': 'Literature'}
])

In [62]:
df

               name    category
0   Albert Einstein     Physics
1       Marie Curie   Chemistry
2  William Faulkner  Literature

## MongoDB

In [67]:
from pymongo import MongoClient

def get_mongo_database(db_name, host='pi.hole',
                       port=27017, username=None, password=None):
    """ Get named database from MongoDB with/out authentication """
    if username and password:
        mongo_url = f'mongodb://{username}:{password}@{host}/{db_name}'
        conn = MongoClient(mongo_url)
    else:
        conn = MongoClient(host, port)
        
    return conn[db_name]

In [68]:
def mongo_to_dataframe(db_name, collection, query={},
                       host="10.0.0.153", port=27017,
                       username=None, password=None,
                       no_id=True):
    """ create a dataframe from mongodb collection """
    db = get_mongo_database(db_name, host, port, username, password)
    
    cursor = db[collection].find(query)
    
    df = pd.DataFrame(list(cursor))
    
    if no_id:
        del df['_id']
    
    return df

In [69]:
df = mongo_to_dataframe('nobel_prize', 'winners')

In [71]:
df

    category             name nationality     sex  year
0    Physics  Albert Einstein       Swiss    male  1921
1    Physics       Paul Dirac     British    male  1933
2  Chemistry      Marie Curie      Polish  female  1911

In [76]:
df.to_dict()

{'category': {0: 'Physics', 1: 'Physics', 2: 'Chemistry'},
 'name': {0: 'Albert Einstein', 1: 'Paul Dirac', 2: 'Marie Curie'},
 'nationality': {0: 'Swiss', 1: 'British', 2: 'Polish'},
 'sex': {0: 'male', 1: 'male', 2: 'female'},
 'year': {0: 1921, 1: 1933, 2: 1911}}

In [75]:
df.to_dict('records')

[{'category': 'Physics',
  'name': 'Albert Einstein',
  'nationality': 'Swiss',
  'sex': 'male',
  'year': 1921},
 {'category': 'Physics',
  'name': 'Paul Dirac',
  'nationality': 'British',
  'sex': 'male',
  'year': 1933},
 {'category': 'Chemistry',
  'name': 'Marie Curie',
  'nationality': 'Polish',
  'sex': 'female',
  'year': 1911}]

In [78]:
def dataframe_to_mongo(df, db_name, collection,
                       host='localhost', port=27017,
                       username=None, password=None):
    """ save a dataframe to mongodb collection """
    db = get_mongo_dataframe(db_name, host, port, username,
                             password)
    
    records = df.to_dict('records')
    db[collection].insert(records)

## Series into DataFrame

In [79]:
s = pd.Series([1, 2, 3, 4])
s

0    1
1    2
2    3
3    4
dtype: int64

In [80]:
s = pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])
s

a    1
b    2
c    3
d    4
dtype: int64

In [81]:
s = pd.Series({'a':1, 'b':2, 'c':3})
s

a    1
b    2
c    3
dtype: int64

In [82]:
s = pd.Series({'a':1, 'b':2, 'c': 3})
s

a    1
b    2
c    3
dtype: int64

In [83]:
s = pd.Series({'a': 1, 'b': 2}, index=['a', 'b', 'c'])
s

a    1.0
b    2.0
c    NaN
dtype: float64

In [84]:
s = pd.Series({'a': 1, 'b': 2, 'c': 3}, index=['a', 'b'])
s

a    1
b    2
dtype: int64

In [86]:
s = pd.Series(9, {'a', 'b', 'c'})
s

a    9
b    9
c    9
dtype: int64

In [87]:
s = pd.Series([1, 2, 3, 4], ['a', 'b', 'c', 'd'])
s

a    1
b    2
c    3
d    4
dtype: int64

In [88]:
s[1:3]

b    2
c    3
dtype: int64

In [89]:
pd.Series([1, 2.1, 'foo']) + pd.Series([2, 3, 'bar'])

0         3
1       5.1
2    foobar
dtype: object

In [90]:
names = pd.Series(['Albert Einstein', 'Marie Curie'], name='name')
categories = pd.Series(['Physics', 'Chemistry'], name='category')

df = pd.concat([names, categories], axis=1)

df.head()

              name   category
0  Albert Einstein    Physics
1      Marie Curie  Chemistry

## Panels

In [91]:
df1 = pd.DataFrame({'foo': [1, 2, 3],
                    'bar': ['a', 'b', 'c']})
df1

   foo bar
0    1   a
1    2   b
2    3   c

In [92]:
df2 = pd.DataFrame({'baz': [7, 8, 9, 11],
                    'qux': ['p', 'q', 'r', 't']})
df2

   baz qux
0    7   p
1    8   q
2    9   r
3   11   t